cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
        <!-- REGISTER "ADCMP_ACFS54" -->
        <register derivedFrom="ADCMP_ACFS10">
          <name>ADCMP_ACFS54</name>
          <description> register ADCMP_ACFS54 </description>
          <addressOffset>0x172</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP0" -->
        <register>
          <name>ADCMP_ACMP0</name>
          <description> register ADCMP_ACMP0 </description>
          <addressOffset>0x1BA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ACMP" -->
            <field>
              <name>ACMP</name>
              <description> bitfield ACMP </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACMP1" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP1</name>
          <description> register ADCMP_ACMP1 </description>
          <addressOffset>0x1BE</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP2" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP2</name>
          <description> register ADCMP_ACMP2 </description>
          <addressOffset>0x1C2</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP3" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP3</name>
          <description> register ADCMP_ACMP3 </description>
          <addressOffset>0x1C6</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP4" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP4</name>
          <description> register ADCMP_ACMP4 </description>
          <addressOffset>0x1CA</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACMP5" -->
        <register derivedFrom="ADCMP_ACMP0">
          <name>ADCMP_ACMP5</name>
          <description> register ADCMP_ACMP5 </description>
          <addressOffset>0x1CE</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSA" -->
        <register>
          <name>ADCMP_ACSA</name>
          <description> register ADCMP_ACSA </description>
          <addressOffset>0x1D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL54" -->
            <field>
              <name>SEL54</name>
              <description> bitfield SEL54 </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL32" -->
            <field>
              <name>SEL32</name>
              <description> bitfield SEL32 </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL10" -->
            <field>
              <name>SEL10</name>
              <description> bitfield SEL10 </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE54" -->
            <field>
              <name>CE54</name>
              <description> bitfield CE54 </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE32" -->
            <field>
              <name>CE32</name>
              <description> bitfield CE32 </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CE10" -->
            <field>
              <name>CE10</name>
              <description> bitfield CE10 </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSC0" -->
        <register>
          <name>ADCMP_ACSC0</name>
          <description> register ADCMP_ACSC0 </description>
          <addressOffset>0x1D4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADSEL" -->
            <field>
              <name>ADSEL</name>
              <description> bitfield ADSEL </description>
              <lsb>2</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUFE" -->
            <field>
              <name>BUFE</name>
              <description> bitfield BUFE </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSD0" -->
        <register>
          <name>ADCMP_ACSD0</name>
          <description> register ADCMP_ACSD0 </description>
          <addressOffset>0x1D5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ZE" -->
            <field>
              <name>ZE</name>
              <description> bitfield ZE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UE" -->
            <field>
              <name>UE</name>
              <description> bitfield UE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE" -->
            <field>
              <name>PE</name>
              <description> bitfield PE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DE" -->
            <field>
              <name>DE</name>
              <description> bitfield DE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OCUS" -->
            <field>
              <name>OCUS</name>
              <description> bitfield OCUS </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMOD" -->
            <field>
              <name>AMOD</name>
              <description> bitfield AMOD </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCMP_ACSC1" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC1</name>
          <description> register ADCMP_ACSC1 </description>
          <addressOffset>0x1D8</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD1" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD1</name>
          <description> register ADCMP_ACSD1 </description>
          <addressOffset>0x1D9</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSC2" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC2</name>
          <description> register ADCMP_ACSC2 </description>
          <addressOffset>0x1DC</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSD2" -->
        <register derivedFrom="ADCMP_ACSD0">
          <name>ADCMP_ACSD2</name>
          <description> register ADCMP_ACSD2 </description>
          <addressOffset>0x1DD</addressOffset>
        </register>
        <!-- REGISTER "ADCMP_ACSC3" -->
        <register derivedFrom="ADCMP_ACSC0">
          <name>ADCMP_ACSC3</name>
          <description> register ADCMP_ACSC3 </description>
          <addressOffset>0x1E0</addressOffset>
        </register>
