cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
        <!-- REGISTER "PPGC13" -->
        <register derivedFrom="PPGC0">
          <name>PPGC13</name>
          <description> register PPGC13 </description>
          <addressOffset>0x2C0</addressOffset>
        </register>
        <!-- REGISTER "PPGC14" -->
        <register derivedFrom="PPGC0">
          <name>PPGC14</name>
          <description> register PPGC14 </description>
          <addressOffset>0x2C5</addressOffset>
        </register>
        <!-- REGISTER "PPGC15" -->
        <register derivedFrom="PPGC0">
          <name>PPGC15</name>
          <description> register PPGC15 </description>
          <addressOffset>0x2C4</addressOffset>
        </register>
        <!-- REGISTER "PPGC16" -->
        <register derivedFrom="PPGC0">
          <name>PPGC16</name>
          <description> register PPGC16 </description>
          <addressOffset>0x301</addressOffset>
        </register>
        <!-- REGISTER "PPGC17" -->
        <register derivedFrom="PPGC0">
          <name>PPGC17</name>
          <description> register PPGC17 </description>
          <addressOffset>0x300</addressOffset>
        </register>
        <!-- REGISTER "PPGC18" -->
        <register derivedFrom="PPGC0">
          <name>PPGC18</name>
          <description> register PPGC18 </description>
          <addressOffset>0x305</addressOffset>
        </register>
        <!-- REGISTER "PPGC19" -->
        <register derivedFrom="PPGC0">
          <name>PPGC19</name>
          <description> register PPGC19 </description>
          <addressOffset>0x304</addressOffset>
        </register>
        <!-- REGISTER "PPGC20" -->
        <register derivedFrom="PPGC0">
          <name>PPGC20</name>
          <description> register PPGC20 </description>
          <addressOffset>0x341</addressOffset>
        </register>
        <!-- REGISTER "PPGC21" -->
        <register derivedFrom="PPGC0">
          <name>PPGC21</name>
          <description> register PPGC21 </description>
          <addressOffset>0x340</addressOffset>
        </register>
        <!-- REGISTER "PPGC22" -->
        <register derivedFrom="PPGC0">
          <name>PPGC22</name>
          <description> register PPGC22 </description>
          <addressOffset>0x345</addressOffset>
        </register>
        <!-- REGISTER "PPGC23" -->
        <register derivedFrom="PPGC0">
          <name>PPGC23</name>
          <description> register PPGC23 </description>
          <addressOffset>0x344</addressOffset>
        </register>
        <!-- REGISTER "PRLH0" -->
        <register>
          <name>PRLH0</name>
          <description> register PRLH0 </description>
          <addressOffset>0x209</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRLH" -->
            <field>
              <name>PRLH</name>
              <description> bitfield PRLH </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRLL0" -->
        <register>
          <name>PRLL0</name>
          <description> register PRLL0 </description>
          <addressOffset>0x208</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRLL" -->
            <field>
              <name>PRLL</name>
              <description> bitfield PRLL </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRLH1" -->
        <register derivedFrom="PRLH0">
          <name>PRLH1</name>
          <description> register PRLH1 </description>
          <addressOffset>0x20D</addressOffset>
        </register>
        <!-- REGISTER "PRLL1" -->
        <register derivedFrom="PRLL0">
          <name>PRLL1</name>
          <description> register PRLL1 </description>
          <addressOffset>0x20C</addressOffset>
        </register>
        <!-- REGISTER "PRLH2" -->
        <register derivedFrom="PRLH0">
          <name>PRLH2</name>
          <description> register PRLH2 </description>
          <addressOffset>0x211</addressOffset>
        </register>
        <!-- REGISTER "PRLL2" -->
        <register derivedFrom="PRLL0">
          <name>PRLL2</name>
          <description> register PRLL2 </description>
          <addressOffset>0x210</addressOffset>
        </register>
        <!-- REGISTER "PRLH3" -->
        <register derivedFrom="PRLH0">
          <name>PRLH3</name>
          <description> register PRLH3 </description>
          <addressOffset>0x215</addressOffset>
        </register>
        <!-- REGISTER "PRLL3" -->
        <register derivedFrom="PRLL0">
          <name>PRLL3</name>
          <description> register PRLL3 </description>
          <addressOffset>0x214</addressOffset>
        </register>
        <!-- REGISTER "PRLH4" -->
        <register derivedFrom="PRLH0">
          <name>PRLH4</name>
          <description> register PRLH4 </description>
          <addressOffset>0x249</addressOffset>
        </register>
        <!-- REGISTER "PRLL4" -->
        <register derivedFrom="PRLL0">
          <name>PRLL4</name>
          <description> register PRLL4 </description>
          <addressOffset>0x248</addressOffset>
        </register>
        <!-- REGISTER "PRLH5" -->
        <register derivedFrom="PRLH0">
          <name>PRLH5</name>
          <description> register PRLH5 </description>
          <addressOffset>0x24D</addressOffset>
        </register>
        <!-- REGISTER "PRLL5" -->
        <register derivedFrom="PRLL0">
          <name>PRLL5</name>
          <description> register PRLL5 </description>
          <addressOffset>0x24C</addressOffset>
        </register>
