cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
        <!-- REGISTER "ADST1" -->
        <register>
          <name>ADST1</name>
          <description> register ADST1 </description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX1" -->
            <field>
              <name>STX1</name>
              <description> bitfield STX1 </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST1" -->
            <field>
              <name>ST1</name>
              <description> bitfield ST1 </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADST0" -->
        <register>
          <name>ADST0</name>
          <description> register ADST0 </description>
          <addressOffset>0x31</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX0" -->
            <field>
              <name>STX0</name>
              <description> bitfield STX0 </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST0" -->
            <field>
              <name>ST0</name>
              <description> bitfield ST0 </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCT" -->
        <register>
          <name>ADCT</name>
          <description> register ADCT </description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CT" -->
            <field>
              <name>CT</name>
              <description> bitfield CT </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRTSL" -->
        <register>
          <name>PRTSL</name>
          <description> register PRTSL </description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRTSL" -->
            <field>
              <name>PRTSL</name>
              <description> bitfield PRTSL </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCTSL" -->
        <register>
          <name>SCTSL</name>
          <description> register SCTSL </description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCTSL" -->
            <field>
              <name>SCTSL</name>
              <description> bitfield SCTSL </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCEN" -->
        <register>
          <name>ADCEN</name>
          <description> register ADCEN </description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFF00</resetValue>
          <resetMask>0xFF03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ENBLTIME" -->
            <field>
              <name>ENBLTIME</name>
              <description> bitfield ENBLTIME </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "READY" -->
            <field>
              <name>READY</name>
              <description> bitfield READY </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ENBL" -->
            <field>
              <name>ENBL</name>
              <description> bitfield ENBL </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMRCOT" -->
        <register>
          <name>WCMRCOT</name>
          <description> register WCMRCOT </description>
          <addressOffset>0x44</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCOOF" -->
            <field>
              <name>RCOOF</name>
              <description> bitfield RCOOF </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMRCIF" -->
        <register>
          <name>WCMRCIF</name>
          <description> register WCMRCIF </description>
          <addressOffset>0x48</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCINT" -->
            <field>
              <name>RCINT</name>
              <description> bitfield RCINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMPCR" -->
        <register>
          <name>WCMPCR</name>
          <description> register WCMPCR </description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCOCD" -->
            <field>
              <name>RCOCD</name>
              <description> bitfield RCOCD </description>
              <lsb>5</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCOIRS" -->
            <field>
              <name>RCOIRS</name>
              <description> bitfield RCOIRS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCOIE" -->
            <field>
              <name>RCOIE</name>
              <description> bitfield RCOIE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCOE" -->
            <field>
              <name>RCOE</name>
              <description> bitfield RCOE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMPSR" -->
        <register>
          <name>WCMPSR</name>
          <description> register WCMPSR </description>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCMD" -->
            <field>
              <name>WCMD</name>
              <description> bitfield WCMD </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCCH" -->
            <field>
              <name>WCCH</name>
              <description> bitfield WCCH </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCMPDL" -->
        <register>
          <name>WCMPDL</name>
          <description> register WCMPDL </description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFC0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMLD" -->
            <field>
              <name>CMLD</name>
              <description> bitfield CMLD </description>
              <lsb>6</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
