cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
        <!-- REGISTER "ELVR1" -->
        <register>
          <name>ELVR1</name>
          <description> register ELVR1 </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LB31" -->
            <field>
              <name>LB31</name>
              <description> bitfield LB31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA31" -->
            <field>
              <name>LA31</name>
              <description> bitfield LA31 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB30" -->
            <field>
              <name>LB30</name>
              <description> bitfield LB30 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA30" -->
            <field>
              <name>LA30</name>
              <description> bitfield LA30 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB29" -->
            <field>
              <name>LB29</name>
              <description> bitfield LB29 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA29" -->
            <field>
              <name>LA29</name>
              <description> bitfield LA29 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB28" -->
            <field>
              <name>LB28</name>
              <description> bitfield LB28 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA28" -->
            <field>
              <name>LA28</name>
              <description> bitfield LA28 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB27" -->
            <field>
              <name>LB27</name>
              <description> bitfield LB27 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA27" -->
            <field>
              <name>LA27</name>
              <description> bitfield LA27 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB26" -->
            <field>
              <name>LB26</name>
              <description> bitfield LB26 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA26" -->
            <field>
              <name>LA26</name>
              <description> bitfield LA26 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB25" -->
            <field>
              <name>LB25</name>
              <description> bitfield LB25 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA25" -->
            <field>
              <name>LA25</name>
              <description> bitfield LA25 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB24" -->
            <field>
              <name>LB24</name>
              <description> bitfield LB24 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA24" -->
            <field>
              <name>LA24</name>
              <description> bitfield LA24 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB23" -->
            <field>
              <name>LB23</name>
              <description> bitfield LB23 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA23" -->
            <field>
              <name>LA23</name>
              <description> bitfield LA23 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB22" -->
            <field>
              <name>LB22</name>
              <description> bitfield LB22 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA22" -->
            <field>
              <name>LA22</name>
              <description> bitfield LA22 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB21" -->
            <field>
              <name>LB21</name>
              <description> bitfield LB21 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA21" -->
            <field>
              <name>LA21</name>
              <description> bitfield LA21 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB20" -->
            <field>
              <name>LB20</name>
              <description> bitfield LB20 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA20" -->
            <field>
              <name>LA20</name>
              <description> bitfield LA20 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB19" -->
            <field>
              <name>LB19</name>
              <description> bitfield LB19 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA19" -->
            <field>
              <name>LA19</name>
              <description> bitfield LA19 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB18" -->
            <field>
              <name>LB18</name>
              <description> bitfield LB18 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA18" -->
            <field>
              <name>LA18</name>
              <description> bitfield LA18 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB17" -->
            <field>
              <name>LB17</name>
              <description> bitfield LB17 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA17" -->
            <field>
              <name>LA17</name>
              <description> bitfield LA17 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LB16" -->
            <field>
              <name>LB16</name>
              <description> bitfield LB16 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LA16" -->
            <field>
              <name>LA16</name>
              <description> bitfield LA16 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMIRR" -->
        <register>
          <name>NMIRR</name>
          <description> register NMIRR </description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NR" -->
            <field>
              <name>NR</name>
              <description> bitfield NR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NMICL" -->
        <register>
          <name>NMICL</name>
          <description> register NMICL </description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NCL" -->
            <field>
              <name>NCL</name>
              <description> bitfield NCL </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
