cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
        <!-- REGISTER "IRQ078MON" -->
        <register>
          <name>IRQ078MON</name>
          <description> register IRQ078MON </description>
          <addressOffset>0x33C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB_DRQ_INT4" -->
            <field>
              <name>USB_DRQ_INT4</name>
              <description> bitfield USB_DRQ_INT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT3" -->
            <field>
              <name>USB_DRQ_INT3</name>
              <description> bitfield USB_DRQ_INT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT2" -->
            <field>
              <name>USB_DRQ_INT2</name>
              <description> bitfield USB_DRQ_INT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT1" -->
            <field>
              <name>USB_DRQ_INT1</name>
              <description> bitfield USB_DRQ_INT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT0" -->
            <field>
              <name>USB_DRQ_INT0</name>
              <description> bitfield USB_DRQ_INT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ079MON" -->
        <register>
          <name>IRQ079MON</name>
          <description> register IRQ079MON </description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB_INT5" -->
            <field>
              <name>USB_INT5</name>
              <description> bitfield USB_INT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT4" -->
            <field>
              <name>USB_INT4</name>
              <description> bitfield USB_INT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT3" -->
            <field>
              <name>USB_INT3</name>
              <description> bitfield USB_INT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT2" -->
            <field>
              <name>USB_INT2</name>
              <description> bitfield USB_INT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT1" -->
            <field>
              <name>USB_INT1</name>
              <description> bitfield USB_INT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT0" -->
            <field>
              <name>USB_INT0</name>
              <description> bitfield USB_INT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ080MON" -->
        <register>
          <name>IRQ080MON</name>
          <description> register IRQ080MON </description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CANINT" -->
            <field>
              <name>CANINT</name>
              <description> bitfield CANINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ081MON" -->
        <register>
          <name>IRQ081MON</name>
          <description> register IRQ081MON </description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CANINT" -->
            <field>
              <name>CANINT</name>
              <description> bitfield CANINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ082MON" -->
        <register>
          <name>IRQ082MON</name>
          <description> register IRQ082MON </description>
          <addressOffset>0x34C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MACLPI" -->
            <field>
              <name>MACLPI</name>
              <description> bitfield MACLPI </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MACPMT" -->
            <field>
              <name>MACPMT</name>
              <description> bitfield MACPMT </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MACSBD" -->
            <field>
              <name>MACSBD</name>
              <description> bitfield MACSBD </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
