cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS1" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS1</name>
      <baseAddress>0x40038100</baseAddress>
      <!-- INTERRUPT "MFS1_RX" -->
      <interrupt>
        <name>MFS1_RX</name>
        <value>62</value>
      </interrupt>
      <!-- INTERRUPT "MFS1_TX" -->
      <interrupt>
        <name>MFS1_TX</name>
        <value>63</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS2" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS2</name>
      <baseAddress>0x40038200</baseAddress>
      <!-- INTERRUPT "MFS2_RX" -->
      <interrupt>
        <name>MFS2_RX</name>
        <value>64</value>
      </interrupt>
      <!-- INTERRUPT "MFS2_TX" -->
      <interrupt>
        <name>MFS2_TX</name>
        <value>65</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS3" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS3</name>
      <baseAddress>0x40038300</baseAddress>
      <!-- INTERRUPT "MFS3_RX" -->
      <interrupt>
        <name>MFS3_RX</name>
        <value>66</value>
      </interrupt>
      <!-- INTERRUPT "MFS3_TX" -->
      <interrupt>
        <name>MFS3_TX</name>
        <value>67</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS4" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS4</name>
      <baseAddress>0x40038400</baseAddress>
      <!-- INTERRUPT "MFS4_RX" -->
      <interrupt>
        <name>MFS4_RX</name>
        <value>68</value>
      </interrupt>
      <!-- INTERRUPT "MFS4_TX" -->
      <interrupt>
        <name>MFS4_TX</name>
        <value>69</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS5" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS5</name>
      <baseAddress>0x40038500</baseAddress>
      <!-- INTERRUPT "MFS5_RX" -->
      <interrupt>
        <name>MFS5_RX</name>
        <value>70</value>
      </interrupt>
      <!-- INTERRUPT "MFS5_TX" -->
      <interrupt>
        <name>MFS5_TX</name>
        <value>71</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS6" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS6</name>
      <baseAddress>0x40038600</baseAddress>
      <!-- INTERRUPT "MFS6_RX" -->
      <interrupt>
        <name>MFS6_RX</name>
        <value>72</value>
      </interrupt>
      <!-- INTERRUPT "MFS6_TX" -->
      <interrupt>
        <name>MFS6_TX</name>
        <value>73</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS7" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS7</name>
      <baseAddress>0x40038700</baseAddress>
      <!-- INTERRUPT "MFS7_RX" -->
      <interrupt>
        <name>MFS7_RX</name>
        <value>74</value>
      </interrupt>
      <!-- INTERRUPT "MFS7_TX" -->
      <interrupt>
        <name>MFS7_TX</name>
        <value>75</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS8" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS8</name>
      <baseAddress>0x40038800</baseAddress>
      <!-- INTERRUPT "MFS8_RX" -->
      <interrupt>
        <name>MFS8_RX</name>
        <value>103</value>
      </interrupt>
      <!-- INTERRUPT "MFS8_TX" -->
      <interrupt>
        <name>MFS8_TX</name>
        <value>104</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS9" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS9</name>
      <baseAddress>0x40038900</baseAddress>
      <!-- INTERRUPT "MFS9_RX" -->
      <interrupt>
        <name>MFS9_RX</name>
        <value>105</value>
      </interrupt>
      <!-- INTERRUPT "MFS9_TX" -->
      <interrupt>
        <name>MFS9_TX</name>
        <value>106</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS10" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS10</name>
      <baseAddress>0x40038A00</baseAddress>
      <!-- INTERRUPT "MFS10_RX" -->
      <interrupt>
        <name>MFS10_RX</name>
        <value>107</value>
      </interrupt>
      <!-- INTERRUPT "MFS10_TX" -->
      <interrupt>
        <name>MFS10_TX</name>
        <value>108</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS11" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS11</name>
      <baseAddress>0x40038B00</baseAddress>
      <!-- INTERRUPT "MFS11_RX" -->
      <interrupt>
        <name>MFS11_RX</name>
        <value>109</value>
      </interrupt>
      <!-- INTERRUPT "MFS11_TX" -->
      <interrupt>
        <name>MFS11_TX</name>
        <value>110</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS12" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS12</name>
      <baseAddress>0x40038C00</baseAddress>
      <!-- INTERRUPT "MFS12_RX" -->
      <interrupt>
        <name>MFS12_RX</name>
        <value>120</value>
      </interrupt>
      <!-- INTERRUPT "MFS12_TX" -->
      <interrupt>
        <name>MFS12_TX</name>
        <value>121</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS13" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS13</name>
      <baseAddress>0x40038D00</baseAddress>
      <!-- INTERRUPT "MFS13_RX" -->
      <interrupt>
        <name>MFS13_RX</name>
        <value>122</value>
      </interrupt>
      <!-- INTERRUPT "MFS13_TX" -->
      <interrupt>
        <name>MFS13_TX</name>
        <value>123</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS14" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS14</name>
      <baseAddress>0x40038E00</baseAddress>
      <!-- INTERRUPT "MFS14_RX" -->
      <interrupt>
        <name>MFS14_RX</name>
        <value>124</value>
      </interrupt>
      <!-- INTERRUPT "MFS14_TX" -->
      <interrupt>
        <name>MFS14_TX</name>
        <value>125</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS15" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS15</name>
      <baseAddress>0x40038F00</baseAddress>
      <!-- INTERRUPT "MFS15_RX" -->
      <interrupt>
        <name>MFS15_RX</name>
        <value>126</value>
      </interrupt>
      <!-- INTERRUPT "MFS15_TX" -->
      <interrupt>
        <name>MFS15_TX</name>
        <value>127</value>
      </interrupt>
    </peripheral>
