cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CLK_GATING" -->
    <peripheral>
      <name>CLK_GATING</name>
      <description> peripheral CLK_GATING </description>
      <groupName>CLK_GATING</groupName>
      <baseAddress>0x4003C100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CKEN0" -->
        <register>
          <name>CKEN0</name>
          <description> register CKEN0 </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x150FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GIOCK" -->
            <field>
              <name>GIOCK</name>
              <description> bitfield GIOCK </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXBCK" -->
            <field>
              <name>EXBCK</name>
              <description> bitfield EXBCK </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMACK" -->
            <field>
              <name>DMACK</name>
              <description> bitfield DMACK </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK3" -->
            <field>
              <name>ADCCK3</name>
              <description> bitfield ADCCK3 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK2" -->
            <field>
              <name>ADCCK2</name>
              <description> bitfield ADCCK2 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK1" -->
            <field>
              <name>ADCCK1</name>
              <description> bitfield ADCCK1 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK0" -->
            <field>
              <name>ADCCK0</name>
              <description> bitfield ADCCK0 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK15" -->
            <field>
              <name>MFSCK15</name>
              <description> bitfield MFSCK15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK14" -->
            <field>
              <name>MFSCK14</name>
              <description> bitfield MFSCK14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK13" -->
            <field>
              <name>MFSCK13</name>
              <description> bitfield MFSCK13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK12" -->
            <field>
              <name>MFSCK12</name>
              <description> bitfield MFSCK12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK11" -->
            <field>
              <name>MFSCK11</name>
              <description> bitfield MFSCK11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK10" -->
            <field>
              <name>MFSCK10</name>
              <description> bitfield MFSCK10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK9" -->
            <field>
              <name>MFSCK9</name>
              <description> bitfield MFSCK9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK8" -->
            <field>
              <name>MFSCK8</name>
              <description> bitfield MFSCK8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK7" -->
            <field>
              <name>MFSCK7</name>
              <description> bitfield MFSCK7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK6" -->
            <field>
              <name>MFSCK6</name>
              <description> bitfield MFSCK6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK5" -->
            <field>
              <name>MFSCK5</name>
              <description> bitfield MFSCK5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK4" -->
            <field>
              <name>MFSCK4</name>
              <description> bitfield MFSCK4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK3" -->
            <field>
              <name>MFSCK3</name>
              <description> bitfield MFSCK3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK2" -->
            <field>
              <name>MFSCK2</name>
              <description> bitfield MFSCK2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK1" -->
            <field>
              <name>MFSCK1</name>
              <description> bitfield MFSCK1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK0" -->
            <field>
              <name>MFSCK0</name>
              <description> bitfield MFSCK0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
