cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
        <!-- REGISTER "CKEN1" -->
        <register>
          <name>CKEN1</name>
          <description> register CKEN1 </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x000F0F0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QDUCK3" -->
            <field>
              <name>QDUCK3</name>
              <description> bitfield QDUCK3 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QDUCK2" -->
            <field>
              <name>QDUCK2</name>
              <description> bitfield QDUCK2 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QDUCK1" -->
            <field>
              <name>QDUCK1</name>
              <description> bitfield QDUCK1 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QDUCK0" -->
            <field>
              <name>QDUCK0</name>
              <description> bitfield QDUCK0 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTCK3" -->
            <field>
              <name>MFTCK3</name>
              <description> bitfield MFTCK3 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTCK2" -->
            <field>
              <name>MFTCK2</name>
              <description> bitfield MFTCK2 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTCK1" -->
            <field>
              <name>MFTCK1</name>
              <description> bitfield MFTCK1 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTCK0" -->
            <field>
              <name>MFTCK0</name>
              <description> bitfield MFTCK0 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMCK3" -->
            <field>
              <name>BTMCK3</name>
              <description> bitfield BTMCK3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMCK2" -->
            <field>
              <name>BTMCK2</name>
              <description> bitfield BTMCK2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMCK1" -->
            <field>
              <name>BTMCK1</name>
              <description> bitfield BTMCK1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMCK0" -->
            <field>
              <name>BTMCK0</name>
              <description> bitfield BTMCK0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MRST1" -->
        <register>
          <name>MRST1</name>
          <description> register MRST1 </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QDURST3" -->
            <field>
              <name>QDURST3</name>
              <description> bitfield QDURST3 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QDURST2" -->
            <field>
              <name>QDURST2</name>
              <description> bitfield QDURST2 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QDURST1" -->
            <field>
              <name>QDURST1</name>
              <description> bitfield QDURST1 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QDURST0" -->
            <field>
              <name>QDURST0</name>
              <description> bitfield QDURST0 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTRST3" -->
            <field>
              <name>MFTRST3</name>
              <description> bitfield MFTRST3 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTRST2" -->
            <field>
              <name>MFTRST2</name>
              <description> bitfield MFTRST2 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTRST1" -->
            <field>
              <name>MFTRST1</name>
              <description> bitfield MFTRST1 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTRST0" -->
            <field>
              <name>MFTRST0</name>
              <description> bitfield MFTRST0 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMRST3" -->
            <field>
              <name>BTMRST3</name>
              <description> bitfield BTMRST3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMRST2" -->
            <field>
              <name>BTMRST2</name>
              <description> bitfield BTMRST2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMRST1" -->
            <field>
              <name>BTMRST1</name>
              <description> bitfield BTMRST1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMRST0" -->
            <field>
              <name>BTMRST0</name>
              <description> bitfield BTMRST0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CKEN2" -->
        <register>
          <name>CKEN2</name>
          <description> register CKEN2 </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000030</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDCCK" -->
            <field>
              <name>SDCCK</name>
              <description> bitfield SDCCK </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANCK1" -->
            <field>
              <name>CANCK1</name>
              <description> bitfield CANCK1 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANCK0" -->
            <field>
              <name>CANCK0</name>
              <description> bitfield CANCK0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBCK1" -->
            <field>
              <name>USBCK1</name>
              <description> bitfield USBCK1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBCK0" -->
            <field>
              <name>USBCK0</name>
              <description> bitfield USBCK0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MRST2" -->
        <register>
          <name>MRST2</name>
          <description> register MRST2 </description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDCRST" -->
            <field>
              <name>SDCRST</name>
              <description> bitfield SDCRST </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANRST1" -->
            <field>
              <name>CANRST1</name>
              <description> bitfield CANRST1 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CANRST0" -->
            <field>
              <name>CANRST0</name>
              <description> bitfield CANRST0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBRST1" -->
            <field>
              <name>USBRST1</name>
              <description> bitfield USBRST1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBRST0" -->
            <field>
              <name>USBRST0</name>
              <description> bitfield USBRST0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
