cmsis-svd/cmsis-svd/data/Spansion/MB9BF36xx_svd.xml
        <!-- REGISTER "CMD" -->
        <register>
          <name>CMD</name>
          <description> register CMD </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CFG" -->
        <register>
          <name>CFG</name>
          <description> register CFG </description>
          <addressOffset>0x9</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWPR" -->
            <field>
              <name>SWPR</name>
              <description> bitfield SWPR </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ESTE" -->
            <field>
              <name>ESTE</name>
              <description> bitfield ESTE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RBDIS" -->
            <field>
              <name>RBDIS</name>
              <description> bitfield RBDIS </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ERINTE" -->
            <field>
              <name>ERINTE</name>
              <description> bitfield ERINTE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWINTE" -->
            <field>
              <name>SWINTE</name>
              <description> bitfield SWINTE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SWTR" -->
        <register>
          <name>SWTR</name>
          <description> register SWTR </description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWST" -->
            <field>
              <name>SWST</name>
              <description> bitfield SWST </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SWREQ" -->
            <field>
              <name>SWREQ</name>
              <description> bitfield SWREQ </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SWDESP" -->
            <field>
              <name>SWDESP</name>
              <description> bitfield SWDESP </description>
              <lsb>0</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MONERS" -->
        <register>
          <name>MONERS</name>
          <description> register MONERS </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFFF5F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EDESP" -->
            <field>
              <name>EDESP</name>
              <description> bitfield EDESP </description>
              <lsb>16</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ECH" -->
            <field>
              <name>ECH</name>
              <description> bitfield ECH </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EHS" -->
            <field>
              <name>EHS</name>
              <description> bitfield EHS </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ESTOP" -->
            <field>
              <name>ESTOP</name>
              <description> bitfield ESTOP </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DER" -->
            <field>
              <name>DER</name>
              <description> bitfield DER </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EST" -->
            <field>
              <name>EST</name>
              <description> bitfield EST </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DREQENB0" -->
        <register>
          <name>DREQENB0</name>
          <description> register DREQENB0 </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DREQENB1" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB1</name>
          <description> register DREQENB1 </description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "DREQENB2" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB2</name>
          <description> register DREQENB2 </description>
          <addressOffset>0x18</addressOffset>
        </register>
        <!-- REGISTER "DREQENB3" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB3</name>
          <description> register DREQENB3 </description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <!-- REGISTER "DREQENB4" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB4</name>
          <description> register DREQENB4 </description>
          <addressOffset>0x20</addressOffset>
        </register>
        <!-- REGISTER "DREQENB5" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB5</name>
          <description> register DREQENB5 </description>
          <addressOffset>0x24</addressOffset>
        </register>
        <!-- REGISTER "DREQENB6" -->
        <register derivedFrom="DREQENB0">
          <name>DREQENB6</name>
          <description> register DREQENB6 </description>
          <addressOffset>0x28</addressOffset>
        </register>
